<!-- dflook/terraform-github-actions {"workspace":"default","backend":"8cb7e4b3fb35b91c0772a9927da3f55537e2ba1b1fa34fc9afa0745fd9d03bab","backend_type":"s3","plan_job_ref":"Job Terraform CI #8 at https://github.com/dannylongeuay/cluster-management/actions/runs/3145699484","plan_hash":"dac2a7c4243caadd37365a16853ea84fd17c5c193b53668381a9cd5b3f56b97b","plan_text_format":"text"} -->
Terraform plan in __terraform/ndsquared-prod-sfo3__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.ndsq_cluster must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "ndsq_cluster" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2022-09-26 02:15:21 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://fbfbd010-5bdb-42f3-90ad-034e8c037c6b.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "************************************" -> (known after apply)
      + ipv4_address   = (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "ndsquared-prod-sfo3"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
        tags           = [
            "ndsquared",
        ]
      ~ updated_at     = "2022-09-26 04:37:16 +0000 UTC" -> (known after apply)
      ~ urn            = "do:kubernetes:fbfbd010-5bdb-42f3-90ad-034e8c037c6b" -> (known after apply)
      ~ vpc_uuid       = "23897c7a-93af-4e0e-96f6-107dcecbce5e" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ maintenance_policy {
          ~ day        = "any" -> (known after apply)
          ~ duration   = "4h0m0s" -> (known after apply)
          ~ start_time = "11:00" -> (known after apply)
        }

      ~ node_pool {
          ~ actual_node_count = 3 -> (known after apply)
          ~ id                = "************************************" -> (known after apply)
          - labels            = {} -> null
          - max_nodes         = 0 -> null
          - min_nodes         = 0 -> null
            name              = "default"
          ~ nodes             = [
              - {
                  - created_at = "2022-09-26 02:15:21 +0000 UTC"
                  - droplet_id = "*********"
                  - id         = "13a7d6f3-d01b-4713-9661-80577b26d785"
                  - name       = "default-76biy"
                  - status     = "running"
                  - updated_at = "2022-09-26 02:17:24 +0000 UTC"
                },
              - {
                  - created_at = "2022-09-26 02:15:21 +0000 UTC"
                  - droplet_id = "*********"
                  - id         = "0de018d0-0c82-40b0-930a-a0ae6223a567"
                  - name       = "default-76bix"
                  - status     = "running"
                  - updated_at = "2022-09-26 02:17:24 +0000 UTC"
                },
              - {
                  - created_at = "2022-09-26 02:15:21 +0000 UTC"
                  - droplet_id = "*********"
                  - id         = "8be9eb5d-0237-43d2-9d06-ed4be327918f"
                  - name       = "default-76bio"
                  - status     = "running"
                  - updated_at = "2022-09-26 02:17:24 +0000 UTC"
                },
            ] -> (known after apply)
          ~ size              = "s-1vcpu-2gb" -> "s-2vcpu-2gb" # forces replacement
          - tags              = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform CI #8](https://github.com/dannylongeuay/cluster-management/actions/runs/3145699484)